#!/bin/bash

# คำสั่ง/ตัวย่อมาจาก:**เรียกว่า Shebang (มาจากคำว่า Sharp # และ Bang !) ตามด้วย Path ของตัวแปรเชลล์ที่ต้องการใช้รันสคริปต์นี้ นั่นคือ /bin/bash
# ต้องอยู่บรรทัดแรกสุดของไฟล์เสมอ เพื่อบอกให้ระบบปฏิบัติการรู้ว่าต้องใช้โปรแกรม Bash ในการอ่านและทำงานกับโค้ดในไฟล์นี้

# • $#: ตัวแปรพิเศษใน Bash ย่อมาจาก Number of arguments (จำนวนอาร์กิวเมนต์ทั้งหมดที่ผู้ใช้พิมพ์ส่งเข้ามา)
# • -eq: ย่อมาจาก Equal (เท่ากับ) ใช้สำหรับการเปรียบเทียบตัวเลข
# • ; then: ย่อมาจาก Therefore (ดังนั้นให้ทำ...)

if [ $# -eq 0 ]; then
    echo "No arguments supplied"
else 
    for arg in "${@:1:4}"; do
    echo "$arg"
    done
fi

#	• for ... in ... ; do: คำสั่งลูป For-loop (วนซ้ำตามจำนวนสมาชิก)
#	• arg: ย่อมาจาก Argument เป็นชื่อตัวแปรที่ตั้งขึ้นมาเพื่อรับค่าในแต่ละรอบ
#	• "${@:1:4}": โครงสร้างนี้เรียกว่า Array Slicing (การหั่นอาร์เรย์)
#		• @ ย่อมาจาก All arguments (อาร์กิวเมนต์ทั้งหมด)
#		• :1 คือ Offset / Start Index (ตำแหน่งเริ่มต้น ซึ่งก็คืออาร์กิวเมนต์ตัวที่ 1)
#		• :4 คือ Length (จำนวนตัวที่จะหยิบมา ซึ่งก็คือหยิบมา 4 ตัว)

#• โดยคำสั่ง echo จะขึ้นบรรทัดใหม่ให้โดยอัตโนมัติเมื่อพิมพ์เสร็จแต่ละตัว

#• for ... in: คำสั่งลูป For-loop (วนซ้ำตามจำนวนสมาชิก)
#• arg: ย่อมาจาก Argument เป็นชื่อตัวแปรที่เราตั้งขึ้นมาเพื่อรับค่าในแต่ละรอบของการวนลูป
#• "$@": ตัวแปรพิเศษใน Bash ย่อมาจาก All arguments (รายการอาร์กิวเมนต์ทั้งหมดที่ถูกส่งเข้ามา โดยแยกแต่ละตัวออกจากกันด้วยช่องว่างอย่างถูกต้อง)
